<?xml version="1.0"?>
<net name="Model2" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="1,3,90,160" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_116" type="Const" version="opset1">
			<data element_type="f32" shape="96, 3, 7, 7" offset="0" size="56448" />
			<output>
				<port id="0" precision="FP32" names="63,self.features.0.weight">
					<dim>96</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::conv2d/Convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>42</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="aten::conv2d/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="56448" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="aten::conv2d/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>42</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="64_1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>42</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="aten::relu_/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>42</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="64,input.6">
					<dim>1</dim>
					<dim>96</dim>
					<dim>42</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="aten::max_pool2d/MaxPool" type="MaxPool" version="opset14">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="ceil_torch" auto_pad="explicit" index_element_type="i64" axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>42</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="66,input.14">
					<dim>1</dim>
					<dim>96</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>96</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_112" type="Const" version="opset1">
			<data element_type="f32" shape="16, 96, 1, 1" offset="56832" size="6144" />
			<output>
				<port id="0" precision="FP32" names="61,self.features.3.squeeze.weight">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="aten::conv2d/Convolution_1" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="aten::conv2d/Reshape_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="62976" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="aten::conv2d/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="67_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="aten::relu_/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="67">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_108" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="63040" size="4096" />
			<output>
				<port id="0" precision="FP32" names="59,self.features.3.expand1x1.weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="aten::conv2d/Convolution_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="aten::conv2d/Reshape_2" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="67136" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="aten::conv2d/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="69_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::relu_/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="69">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_104" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 3, 3" offset="67392" size="36864" />
			<output>
				<port id="0" precision="FP32" names="57,self.features.3.expand3x3.weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="aten::conv2d/Convolution_3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="aten::conv2d/Reshape_3" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="104256" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="aten::conv2d/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="71_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="aten::relu_/Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="71">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="74,input.18">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_100" type="Const" version="opset1">
			<data element_type="f32" shape="16, 128, 1, 1" offset="104512" size="8192" />
			<output>
				<port id="0" precision="FP32" names="55,self.features.4.squeeze.weight">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="aten::conv2d/Convolution_4" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="aten::conv2d/Reshape_4" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="112704" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="aten::conv2d/Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="75_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="aten::relu_/Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="75">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_96" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="112768" size="4096" />
			<output>
				<port id="0" precision="FP32" names="53,self.features.4.expand1x1.weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="aten::conv2d/Convolution_5" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="aten::conv2d/Reshape_5" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="116864" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="aten::conv2d/Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="77_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="aten::relu_/Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="77">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_92" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 3, 3" offset="117120" size="36864" />
			<output>
				<port id="0" precision="FP32" names="51,self.features.4.expand3x3.weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="aten::conv2d/Convolution_6" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="aten::conv2d/Reshape_6" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="153984" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="aten::conv2d/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="79_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="aten::relu_/Relu_6" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="79">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="82,input.21">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_88" type="Const" version="opset1">
			<data element_type="f32" shape="32, 128, 1, 1" offset="154240" size="16384" />
			<output>
				<port id="0" precision="FP32" names="49,self.features.5.squeeze.weight">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="aten::conv2d/Convolution_7" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="aten::conv2d/Reshape_7" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="170624" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="aten::conv2d/Add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="83_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="aten::relu_/Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="83">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_84" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 1, 1" offset="170752" size="16384" />
			<output>
				<port id="0" precision="FP32" names="47,self.features.5.expand1x1.weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="aten::conv2d/Convolution_8" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="aten::conv2d/Reshape_8" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="187136" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="aten::conv2d/Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="85_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="aten::relu_/Relu_8" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="85">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_80" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 3, 3" offset="187648" size="147456" />
			<output>
				<port id="0" precision="FP32" names="45,self.features.5.expand3x3.weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="aten::conv2d/Convolution_9" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="aten::conv2d/Reshape_9" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="335104" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="aten::conv2d/Add_9" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="87_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="aten::relu_/Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="87">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="aten::cat/Concat_2" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="90,input.25">
					<dim>1</dim>
					<dim>256</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="aten::max_pool2d/MaxPool_1" type="MaxPool" version="opset14">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="ceil_torch" auto_pad="explicit" index_element_type="i64" axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>21</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="91,input.29">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_76" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256, 1, 1" offset="335616" size="32768" />
			<output>
				<port id="0" precision="FP32" names="43,self.features.7.squeeze.weight">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="aten::conv2d/Convolution_10" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="aten::conv2d/Reshape_10" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="368384" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="aten::conv2d/Add_10" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="92_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="aten::relu_/Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="92">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_72" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 1, 1" offset="368512" size="16384" />
			<output>
				<port id="0" precision="FP32" names="41,self.features.7.expand1x1.weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="aten::conv2d/Convolution_11" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="aten::conv2d/Reshape_11" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="384896" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="aten::conv2d/Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="94_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="aten::relu_/Relu_11" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="94">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_68" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 3, 3" offset="385408" size="147456" />
			<output>
				<port id="0" precision="FP32" names="39,self.features.7.expand3x3.weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="aten::conv2d/Convolution_12" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="aten::conv2d/Reshape_12" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="532864" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="aten::conv2d/Add_12" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="96_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="aten::relu_/Relu_12" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="96">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="aten::cat/Concat_3" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="99,input.33">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_64" type="Const" version="opset1">
			<data element_type="f32" shape="48, 256, 1, 1" offset="533376" size="49152" />
			<output>
				<port id="0" precision="FP32" names="37,self.features.8.squeeze.weight">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="aten::conv2d/Convolution_13" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="aten::conv2d/Reshape_13" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="582528" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="aten::conv2d/Add_13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="100_1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="aten::relu_/Relu_13" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="100">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_60" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 1, 1" offset="582720" size="36864" />
			<output>
				<port id="0" precision="FP32" names="35,self.features.8.expand1x1.weight">
					<dim>192</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="aten::conv2d/Convolution_14" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="aten::conv2d/Reshape_14" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="619584" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="aten::conv2d/Add_14" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="102_1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="aten::relu_/Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="102">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_56" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 3, 3" offset="620352" size="331776" />
			<output>
				<port id="0" precision="FP32" names="33,self.features.8.expand3x3.weight">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="aten::conv2d/Convolution_15" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="aten::conv2d/Reshape_15" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="952128" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="aten::conv2d/Add_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="104_1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="aten::relu_/Relu_15" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="104">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="aten::cat/Concat_4" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="107,input.37">
					<dim>1</dim>
					<dim>384</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_52" type="Const" version="opset1">
			<data element_type="f32" shape="48, 384, 1, 1" offset="952896" size="73728" />
			<output>
				<port id="0" precision="FP32" names="31,self.features.9.squeeze.weight">
					<dim>48</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="aten::conv2d/Convolution_16" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="aten::conv2d/Reshape_16" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="1026624" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="aten::conv2d/Add_16" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="108_1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="aten::relu_/Relu_16" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="108">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_48" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 1, 1" offset="1026816" size="36864" />
			<output>
				<port id="0" precision="FP32" names="29,self.features.9.expand1x1.weight">
					<dim>192</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="aten::conv2d/Convolution_17" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="aten::conv2d/Reshape_17" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="1063680" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="aten::conv2d/Add_17" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="110_1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="aten::relu_/Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="110">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_44" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 3, 3" offset="1064448" size="331776" />
			<output>
				<port id="0" precision="FP32" names="27,self.features.9.expand3x3.weight">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="aten::conv2d/Convolution_18" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="aten::conv2d/Reshape_18" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="1396224" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="aten::conv2d/Add_18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="112_1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="aten::relu_/Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="112">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="aten::cat/Concat_5" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="115,input.41">
					<dim>1</dim>
					<dim>384</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_40" type="Const" version="opset1">
			<data element_type="f32" shape="64, 384, 1, 1" offset="1396992" size="98304" />
			<output>
				<port id="0" precision="FP32" names="25,self.features.10.squeeze.weight">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="aten::conv2d/Convolution_19" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="aten::conv2d/Reshape_19" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1495296" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="aten::conv2d/Add_19" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="116_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="aten::relu_/Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="116">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_36" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="1495552" size="65536" />
			<output>
				<port id="0" precision="FP32" names="23,self.features.10.expand1x1.weight">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="aten::conv2d/Convolution_20" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>19</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
